app/controllers/posts_controller.rb

INSERT INTO "posts" ("title", "description", "keyword", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["title", nil], ["description", "hello how's it going"], ["keyword", "first post"], ["created_at", "2023-12-04 11:54:45.088398"], ["updated_at", "2023-12-04 11:54:45.088398"]]
---
  def create
    @post = Post.new(post_params)

    respond_to do |format|
      if @post.save

UPDATE "posts" SET "title" = ?, "description" = ?, "keyword" = ?, "updated_at" = ? WHERE "posts"."id" = ?  [["title", "First new post"], ["description", "wow! posted new one"], ["keyword", "first post"], ["updated_at", "2023-12-04 12:32:58.198143"], ["id", 5]]
---
  def update
    respond_to do |format|
      if @post.update(post_params)